In [2]:
# Import pandas and load data
import pandas as pd

titanic = pd.read_csv('Titanic Dataset.csv')

# Quick check
print(titanic.shape) 
titanic.head()

(1309, 14)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [3]:
# Select one column (returns a Series)
names = titanic['name']

# Display first 10 values
print(names.head(10))

# This gets just the 'name' column from the titanic DataFrame

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5                                Anderson, Mr. Harry
6                  Andrews, Miss. Kornelia Theodosia
7                             Andrews, Mr. Thomas Jr
8      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9                            Artagaveytia, Mr. Ramon
Name: name, dtype: object

In [4]:
# Age column

     

# Fare column

In [5]:
# Select multiple columns (note the double brackets)
subset = titanic[['name', 'age', 'sex']]

# Display first 5 rows
print(subset.head())

# The outer brackets mean 'select from titanic'
# The inner brackets are a list of column names

                                              name    age     sex
0                    Allen, Miss. Elisabeth Walton  29.00  female
1                   Allison, Master. Hudson Trevor   0.92    male
2                     Allison, Miss. Helen Loraine   2.00  female
3             Allison, Mr. Hudson Joshua Creighton  30.00    male
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  female

In [6]:
# Create a condition (True/False for each row)
survived_condition = titanic['survived'] == 1

# Use condition to filter
survivors = titanic[survived_condition]

# Or combine in one line
survivors = titanic[titanic['survived'] == 1]

print(f"Total passengers: {len(titanic)}")
print(f"Survivors: {len(survivors)}")

Total passengers: 1309
Survivors: 500

In [7]:
# Step 1: Create a True/False mask
mask = titanic['age'] > 30
print(mask.head())  # Shows True, False, True, False, etc.

# Step 2: Use mask to filter
older_passengers = titanic[mask]

# The DataFrame keeps only rows where mask is True
print(older_passengers[['name', 'age']].head())

0    False
1    False
2    False
3    False
4    False
Name: age, dtype: bool
                                            name   age
5                            Anderson, Mr. Harry  48.0
6              Andrews, Miss. Kornelia Theodosia  63.0
7                         Andrews, Mr. Thomas Jr  39.0
8  Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0
9                        Artagaveytia, Mr. Ramon  71.0

In [8]:
# First class passengers
first_class = titanic[titanic['pclass'] == 1]

# Female passengers
females = titanic[titanic['sex'] == 'female']

# Children (age 12 or under)
children = titanic[titanic['age'] <= 12]

# Passengers who paid more than $50
expensive_tickets = titanic[titanic['fare'] > 50]

# For each filter, you can check how many rows matched
print(f"First class passengers: {len(first_class)}")
print(f"Female passengers: {len(females)}")

First class passengers: 323
Female passengers: 466

In [10]:
# AND: Both conditions must be true
female_survivors = titanic[
    (titanic['sex'] == 'female') & 
    (titanic['survived'] == 1)
]

In [11]:
upper_class = titanic[
    (titanic['pclass'] == 1) | 
    (titanic['pclass'] == 2)
]